Το Έργο **"Πληροφορικές βελτιώσεις στην εποχιακή πρόγνωση του καιρού"** χωρίζεται σε 2 φάσεις με 2 επιμέρους παραδοτέα:

**Παραδοτέο 1: Οι κώδικες που θα αναπτυχθούν και θα τροποποιηθούν στο πλαίσιο βελτίωσης της επιχειρησιακής λειτουργίας του μοντέλου.**

**Παραδοτέο 2: Οι κώδικες αξιολόγησης των εποχιακών προγνώσεων. Θα διατεθούν επίσης ελεύθερα οι τρέχουσες εποχιακές προγνώσεις υπό μορφή θεματικών χαρτών και δεδομένων δυαδικής μορφής.**

Το Έργο υλοποιήθηκε με την ανάπτυξη πηγαίου κώδικα σε Linux Shell και στη γλώσσα προγραμματισμού NCL. Η εμπειρία στον τομέα των αριθμητικών μοντέλων πρόγνωσης και σε μεγάλα υπολογιστικά συστήματα με λειτουργικό σύστημα Linux, καθιστά κατάλληλο και αποτελεσματικό τον προγραμματισμό σε Linux Shell και σε NCL (η γλώσσα προγραμματισμού ΝCL φτιάχτηκε ειδικά για τη διαχείριση δεδομένων από αριθμητικά μοντέλα) για την επίτευξη της βελτιστοποίηση της επιχειρησιακής λειτουργίας του  μοντέλου και της διαχείρισης, οπτικοποίησης και αξιολόγησης των προγνώσεών του. 
